; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-5-7-170)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p5-3 - location
	p5-6 - location
	p2-3 - location
	p2-6 - location
	p4-0 - location
	p4-1 - location
	p4-2 - location
	p3-0 - location
	p3-4 - location
	p0-5 - location
	p0-6 - location
	)
	(:init
	(at driver1 s5)
	(at driver2 s1)
	(at driver3 s6)
	(at truck1 s4)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s3)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s1)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s0)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s3)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at package1 s3)
	(at package2 s0)
	(at package3 s2)
	(at package4 s2)
	(at package5 s3)
	(at package6 s6)
	(at package7 s2)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(= (time-to-walk s5 p5-3) 35)
	(= (time-to-walk p5-3 s5) 35)
	(= (time-to-walk s3 p5-3) 15)
	(= (time-to-walk p5-3 s3) 15)
	(path s5 p5-6)
	(path p5-6 s5)
	(path s6 p5-6)
	(path p5-6 s6)
	(= (time-to-walk s5 p5-6) 1)
	(= (time-to-walk p5-6 s5) 1)
	(= (time-to-walk s6 p5-6) 19)
	(= (time-to-walk p5-6 s6) 19)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(= (time-to-walk s2 p2-3) 33)
	(= (time-to-walk p2-3 s2) 33)
	(= (time-to-walk s3 p2-3) 20)
	(= (time-to-walk p2-3 s3) 20)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(= (time-to-walk s2 p2-6) 35)
	(= (time-to-walk p2-6 s2) 35)
	(= (time-to-walk s6 p2-6) 25)
	(= (time-to-walk p2-6 s6) 25)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(= (time-to-walk s4 p4-0) 7)
	(= (time-to-walk p4-0 s4) 7)
	(= (time-to-walk s0 p4-0) 24)
	(= (time-to-walk p4-0 s0) 24)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(= (time-to-walk s4 p4-1) 29)
	(= (time-to-walk p4-1 s4) 29)
	(= (time-to-walk s1 p4-1) 6)
	(= (time-to-walk p4-1 s1) 6)
	(path s4 p4-2)
	(path p4-2 s4)
	(path s2 p4-2)
	(path p4-2 s2)
	(= (time-to-walk s4 p4-2) 36)
	(= (time-to-walk p4-2 s4) 36)
	(= (time-to-walk s2 p4-2) 10)
	(= (time-to-walk p4-2 s2) 10)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(= (time-to-walk s3 p3-0) 23)
	(= (time-to-walk p3-0 s3) 23)
	(= (time-to-walk s0 p3-0) 14)
	(= (time-to-walk p3-0 s0) 14)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(= (time-to-walk s3 p3-4) 25)
	(= (time-to-walk p3-4 s3) 25)
	(= (time-to-walk s4 p3-4) 37)
	(= (time-to-walk p3-4 s4) 37)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(= (time-to-walk s0 p0-5) 9)
	(= (time-to-walk p0-5 s0) 9)
	(= (time-to-walk s5 p0-5) 28)
	(= (time-to-walk p0-5 s5) 28)
	(path s0 p0-6)
	(path p0-6 s0)
	(path s6 p0-6)
	(path p0-6 s6)
	(= (time-to-walk s0 p0-6) 36)
	(= (time-to-walk p0-6 s0) 36)
	(= (time-to-walk s6 p0-6) 36)
	(= (time-to-walk p0-6 s6) 36)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 14)
	(= (time-to-drive s0 s1) 14)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 12)
	(= (time-to-drive s2 s1) 12)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 17)
	(= (time-to-drive s4 s1) 17)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 21)
	(= (time-to-drive s2 s0) 21)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 7)
	(= (time-to-drive s4 s0) 7)
	(link s0 s5)
	(link s5 s0)
	(= (time-to-drive s0 s5) 38)
	(= (time-to-drive s5 s0) 38)
	(link s0 s6)
	(link s6 s0)
	(= (time-to-drive s0 s6) 31)
	(= (time-to-drive s6 s0) 31)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 37)
	(= (time-to-drive s2 s6) 37)
	(link s6 s4)
	(link s4 s6)
	(= (time-to-drive s6 s4) 22)
	(= (time-to-drive s4 s6) 22)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 26)
	(= (time-to-drive s0 s3) 26)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 22)
	(= (time-to-drive s1 s3) 22)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 34)
	(= (time-to-drive s4 s3) 34)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 23)
	(= (time-to-drive s3 s2) 23)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 12)
	(= (time-to-drive s4 s2) 12)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s3)
	(at driver2 s0)
	(at truck1 s3)
	(at package1 s0)
	(at package2 s0)
	(at package3 s4)
	(at package4 s6)
	(at package5 s4)
	(at package6 s5)
	(at package7 s0)
	))

(:metric minimize (+ (* 2 (total-time)) (* 4 (fuel-used))))

)

; plan
1. (board-truck driver2 truck3 s1)
   deleted: (at driver2 s1) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 1 of 10
2. (walk driver1 s5 p5-3)
   deleted: (at driver1 s5)
   added: (at driver1 p5-3)
   goals met: 1 of 10
3. (drive-truck truck3 s1 s2 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   changed: (fuel-used) from 0 to 120
   goals met: 1 of 10
4. (load-truck package3 truck3 s2)
   deleted: (at package3 s2)
   added: (in package3 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 1 of 10
5. (load-truck package4 truck3 s2)
   deleted: (at package4 s2)
   added: (in package4 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 1 of 10
6. (load-truck package7 truck3 s2)
   deleted: (at package7 s2)
   added: (in package7 truck3)
   changed: (load truck3) from 2 to 3, (fuel-per-minute truck3) from 13 to 16
   goals met: 1 of 10
7. (drive-truck truck3 s2 s0 driver2)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   changed: (fuel-used) from 120 to 456
   goals met: 1 of 10
8. (unload-truck package7 truck3 s0)
   deleted: (in package7 truck3)
   added: (at package7 s0)
   changed: (load truck3) from 3 to 2, (fuel-per-minute truck3) from 16 to 13
   goals met: 2 of 10
9. (drive-truck truck3 s0 s4 driver2)
   deleted: (at truck3 s0)
   added: (at truck3 s4)
   changed: (fuel-used) from 456 to 547
   goals met: 2 of 10
10. (unload-truck package3 truck3 s4)
   deleted: (in package3 truck3)
   added: (at package3 s4)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 3 of 10
11. (drive-truck truck3 s4 s3 driver2)
   deleted: (at truck3 s4)
   added: (at truck3 s3)
   changed: (fuel-used) from 547 to 921
   goals met: 3 of 10
12. (load-truck package1 truck3 s3)
   deleted: (at package1 s3)
   added: (in package1 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 3 of 10
13. (load-truck package5 truck3 s3)
   deleted: (at package5 s3)
   added: (in package5 truck3)
   changed: (load truck3) from 2 to 3, (fuel-per-minute truck3) from 13 to 16
   goals met: 3 of 10
14. (drive-truck truck3 s3 s0 driver2)
   deleted: (at truck3 s3)
   added: (at truck3 s0)
   changed: (fuel-used) from 921 to 1337
   goals met: 3 of 10
15. (walk driver1 p5-3 s3)
   deleted: (at driver1 p5-3)
   added: (at driver1 s3)
   goals met: 4 of 10
16. (unload-truck package1 truck3 s0)
   deleted: (in package1 truck3)
   added: (at package1 s0)
   changed: (load truck3) from 3 to 2, (fuel-per-minute truck3) from 16 to 13
   goals met: 5 of 10
17. (drive-truck truck3 s0 s6 driver2)
   deleted: (at truck3 s0)
   added: (at truck3 s6)
   changed: (fuel-used) from 1337 to 1740
   goals met: 5 of 10
18. (unload-truck package4 truck3 s6)
   deleted: (in package4 truck3)
   added: (at package4 s6)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 6 of 10
19. (load-truck package6 truck3 s6)
   deleted: (at package6 s6)
   added: (in package6 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 6 of 10
20. (drive-truck truck3 s6 s4 driver2)
   deleted: (at truck3 s6)
   added: (at truck3 s4)
   changed: (fuel-used) from 1740 to 2026
   goals met: 6 of 10
21. (unload-truck package5 truck3 s4)
   deleted: (in package5 truck3)
   added: (at package5 s4)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 7 of 10
22. (drive-truck truck3 s4 s0 driver2)
   deleted: (at truck3 s4)
   added: (at truck3 s0)
   changed: (fuel-used) from 2026 to 2103
   goals met: 7 of 10
23. (drive-truck truck3 s0 s5 driver2)
   deleted: (at truck3 s0)
   added: (at truck3 s5)
   changed: (fuel-used) from 2103 to 2521
   goals met: 7 of 10
24. (unload-truck package6 truck3 s5)
   deleted: (in package6 truck3)
   added: (at package6 s5)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 8 of 10
25. (drive-truck truck3 s5 s0 driver2)
   deleted: (at truck3 s5)
   added: (at truck3 s0)
   changed: (fuel-used) from 2521 to 2901
   goals met: 8 of 10
26. (disembark-truck driver2 truck3 s0)
   deleted: (driving driver2 truck3)
   added: (at driver2 s0) (empty truck3)
   goals met: 9 of 10
27. (walk driver1 s3 p3-4)
   deleted: (at driver1 s3)
   added: (at driver1 p3-4)
   goals met: 8 of 10
28. (walk driver1 p3-4 s4)
   deleted: (at driver1 p3-4)
   added: (at driver1 s4)
   goals met: 8 of 10
29. (board-truck driver1 truck1 s4)
   deleted: (at driver1 s4) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 8 of 10
30. (drive-truck truck1 s4 s3 driver1)
   deleted: (at truck1 s4)
   added: (at truck1 s3)
   changed: (fuel-used) from 2901 to 3241
   goals met: 9 of 10
31. (disembark-truck driver1 truck1 s3)
   deleted: (driving driver1 truck1)
   added: (at driver1 s3) (empty truck1)
   goals met: 10 of 10
